netcheck.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-27 Sat 11:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>netcheck - identify connected network</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pradyumna Paranjape" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">netcheck - identify connected network</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd355be8">Description</a>
<ul>
<li><a href="#orgd181d29">IP-ADDRESS</a></li>
<li><a href="#org7202de9">AP-ADDRESS</a></li>
<li><a href="#orgf3f7d6d">Net-State-Code</a></li>
</ul>
</li>
<li><a href="#org5287ec0">Setup</a></li>
<li><a href="#org99916f3">Code</a>
<ul>
<li><a href="#org0c67c07">Handle global variables and exits</a></li>
<li><a href="#org39eb762">Identify intranet</a></li>
<li><a href="#org38fdafd">ping</a></li>
<li><a href="#org1bfa82d">Main routine call</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd355be8" class="outline-2">
<h2 id="orgd355be8">Description</h2>
<div class="outline-text-2" id="text-orgd355be8">
<p>
Identify connected network.
Print the following string
</p>
<pre class="example" id="orgbd7885b">
&lt;IP-ADDRESS&gt;\t&lt;AP-ADDRESS&gt;\t&lt;Net-State-Code&gt;
</pre>
</div>
<div id="outline-container-orgd181d29" class="outline-3">
<h3 id="orgd181d29">IP-ADDRESS</h3>
<div class="outline-text-3" id="text-orgd181d29">
<p>
Output of <code>hostname -I</code>
</p>
</div>
</div>

<div id="outline-container-org7202de9" class="outline-3">
<h3 id="org7202de9">AP-ADDRESS</h3>
<div class="outline-text-3" id="text-org7202de9">
<p>
Access-Point address. Default route to which packets are sent.
</p>
</div>
</div>

<div id="outline-container-orgf3f7d6d" class="outline-3">
<h3 id="orgf3f7d6d">Net-State-Code</h3>
<div class="outline-text-3" id="text-orgf3f7d6d">
<p>
5-bit number representing inferred state of network
</p>
<ul class="org-ul">
<li>bit 1: (1) Work-network connected</li>
<li>bit 2: (2) Home-network connected</li>
<li>bit 3: (4) AP responds to <code>ping</code></li>
<li>bit 4: (8) Google's DNS server 8.8.8.8 responds to <code>ping</code></li>
<li>bit 5: (16) Google's address (gets resolved) and responds to <code>ping</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5287ec0" class="outline-2">
<h2 id="org5287ec0">Setup</h2>
<div class="outline-text-2" id="text-org5287ec0">
<p>
Following variables should be declared by adding lines to
<code>${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.&lt;some_name&gt;rc</code>
</p>
<ul class="org-ul">
<li>home_ap: ip addresses that imply presence at home (separator: &lt;space&gt;)</li>
<li>work_ap: ip addresses that imply presence at work (separator: &lt;space&gt;)</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #ffffaf;">home_ap</span>=<span style="color: #98be65;">"10.0.0.1 10.0.0.2"</span>
<span style="color: #ffffaf;">work_ap</span>=<span style="color: #98be65;">"192.168.0.1 192.168.1.1"</span>
<span style="color: #d76f10;">export</span> home_ap
<span style="color: #d76f10;">export</span> work_ap

</pre>
</div>
</div>
</div>

<div id="outline-container-org99916f3" class="outline-2">
<h2 id="org99916f3">Code</h2>
<div class="outline-text-2" id="text-org99916f3">
<p>
This section tangles source code
</p>
</div>
<div id="outline-container-org0c67c07" class="outline-3">
<h3 id="org0c67c07">Handle global variables and exits</h3>
<div class="outline-text-3" id="text-org0c67c07">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">set_vars</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #ffffaf;">google_ip</span>=<span style="color: #98be65;">"8.8.8.8"</span>
    <span style="color: #ffffaf;">google_dn</span>=<span style="color: #98be65;">"www.google.com"</span>
    <span style="color: #51afef;">if</span> <span style="color: #51afef; font-weight: bold;">!</span> <span style="color: #ffffaf;">ip_addr</span>=<span style="color: #98be65;">"$(hostname -I 2&gt;/dev/null)"</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">ip_addr</span>=<span style="color: #98be65;">"$(hostname -i | awk '{print $(NF);}')"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #ffffaf;">ap_addr</span>=<span style="color: #98be65;">"$(ip route show default \</span>
<span style="color: #98be65;">            | grep -o "\([0-9]\{1,3\}\.\)\{3\}[0-9]\{1,3\}")"</span>
    <span style="color: #ffffaf;">netstate</span>=<span style="color: #da8548; font-weight: bold;">0</span>
    <span style="color: #ffffaf;">work_net</span>=<span style="color: #da8548; font-weight: bold;">1</span>
    <span style="color: #ffffaf;">home_net</span>=<span style="color: #da8548; font-weight: bold;">2</span>
    <span style="color: #ffffaf;">intranet</span>=<span style="color: #da8548; font-weight: bold;">4</span>
    <span style="color: #ffffaf;">internet</span>=<span style="color: #da8548; font-weight: bold;">8</span>
    <span style="color: #ffffaf;">googledn</span>=<span style="color: #da8548; font-weight: bold;">16</span>
<span style="color: #51afef;">}</span>

<span style="color: #9f5f9f; font-weight: bold;">unset_vars</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #d76f10;">unset</span> netstate
    <span style="color: #d76f10;">unset</span> ip_addr
    <span style="color: #d76f10;">unset</span> ap_addr
    <span style="color: #d76f10;">unset</span> google_ip
    <span style="color: #d76f10;">unset</span> google_dn
    <span style="color: #d76f10;">unset</span> googledn
    <span style="color: #d76f10;">unset</span> internet
    <span style="color: #d76f10;">unset</span> intranet
    <span style="color: #d76f10;">unset</span> home_net
    <span style="color: #d76f10;">unset</span> work_net
<span style="color: #51afef;">}</span>

<span style="color: #9f5f9f; font-weight: bold;">clean_exit</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    unset_vars
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${1}"</span> <span style="color: #c678dd;">]</span> &amp;&amp; <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${1}"</span> -ne <span style="color: #98be65;">"0"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${2}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
            printf <span style="color: #98be65;">"${2}\n"</span> &gt;&amp;<span style="color: #da8548; font-weight: bold;">2</span>
        <span style="color: #51afef;">fi</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2086</span>
        <span style="color: #51afef;">exit</span> $<span style="color: #c678dd;">{</span><span style="color: #da8548; font-weight: bold;">1</span><span style="color: #c678dd;">}</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -n <span style="color: #98be65;">"${2}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2059</span>
        printf <span style="color: #98be65;">"${2}\n"</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">exit</span> <span style="color: #da8548; font-weight: bold;">0</span>
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org39eb762" class="outline-3">
<h3 id="org39eb762">Identify intranet</h3>
<div class="outline-text-3" id="text-org39eb762">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">at_home</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2154</span>
    <span style="color: #51afef;">for</span> ap<span style="color: #51afef;"> in</span> $<span style="color: #c678dd;">{</span><span style="color: #ffffaf;">home_ap</span><span style="color: #c678dd;">}</span>; <span style="color: #51afef;">do</span>
        <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #98be65;">"${ap}"</span> = <span style="color: #98be65;">"${ap_addr}"</span>  <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
            <span style="color: #ffffaf;">netstate</span>=$<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>netstate | home_net<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
            <span style="color: #51afef;">break</span>
        <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">done</span>
    <span style="color: #d76f10;">unset</span> ap
<span style="color: #51afef;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org38fdafd" class="outline-3">
<h3 id="org38fdafd">ping</h3>
<div class="outline-text-3" id="text-org38fdafd">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">ping_target</span> <span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"${1}"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #51afef;">return</span> <span style="color: #da8548; font-weight: bold;">1</span>
    <span style="color: #51afef;">fi</span>
    ping -c <span style="color: #da8548; font-weight: bold;">1</span> -q -w <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #98be65;">"${1}"</span> &gt;/dev/null <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span>
    <span style="color: #51afef;">return</span> $<span style="color: #ffffaf;">?</span>
<span style="color: #51afef;">}</span>

<span style="color: #9f5f9f; font-weight: bold;">check_ping</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    <span style="color: #51afef;">for</span> line<span style="color: #51afef;"> in</span> $<span style="color: #da8548; font-weight: bold;">1</span>; <span style="color: #51afef;">do</span>
        extract_key <span style="color: #98be65;">"${line}"</span>
    <span style="color: #51afef;">done</span>

    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> -z <span style="color: #98be65;">"$ip_addr"</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        clean_exit <span style="color: #da8548; font-weight: bold;">1</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> ping_target <span style="color: #98be65;">"${google_dn}"</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">netstate</span>=$<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>netstate | googledn | internet<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
    <span style="color: #51afef;">elif</span> ping_target <span style="color: #98be65;">"${google_ip}"</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">can't resolve dns</span>
        <span style="color: #ffffaf;">netstate</span>=$<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>netstate | internet<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> ping_target <span style="color: #98be65;">"${ap_addr}"</span>; <span style="color: #51afef;">then</span>
        <span style="color: #ffffaf;">netstate</span>=$<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>netstate | intranet<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #51afef;">if</span> <span style="color: #c678dd;">[</span> <span style="color: #51afef; font-weight: bold;">!</span> $<span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>netstate &amp; home_net<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span> = $<span style="color: #ffffaf;">home_net</span> <span style="color: #c678dd;">]</span>; <span style="color: #51afef;">then</span>
        <span style="color: #3f4f5f; background-color: #0f0f0f;"># </span><span style="color: #3f4f5f; background-color: #0f0f0f;">shellcheck disable=SC2154</span>
        <span style="color: #51afef;">for</span> ap<span style="color: #51afef;"> in</span> $<span style="color: #c678dd;">{</span><span style="color: #ffffaf;">work_ap</span><span style="color: #c678dd;">}</span>; <span style="color: #51afef;">do</span>
            <span style="color: #51afef;">if</span> ping_target <span style="color: #98be65;">"${ap}"</span>; <span style="color: #51afef;">then</span>
                <span style="color: #ffffaf;">netstate</span>=$<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>netstate | work_net<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
                <span style="color: #51afef;">break</span>
            <span style="color: #51afef;">fi</span>
        <span style="color: #51afef;">done</span>
    <span style="color: #51afef;">fi</span>
    <span style="color: #d76f10;">unset</span> ap
<span style="color: #51afef;">}</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org1bfa82d" class="outline-3">
<h3 id="org1bfa82d">Main routine call</h3>
<div class="outline-text-3" id="text-org1bfa82d">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #9f5f9f; font-weight: bold;">main</span><span style="color: #51afef;">()</span> <span style="color: #51afef;">{</span>
    set_vars
    at_home
    check_ping
    printf <span style="color: #98be65;">"%s\t%s\t%s\n"</span> <span style="color: #98be65;">"${ip_addr}"</span> <span style="color: #98be65;">"${ap_addr}"</span> <span style="color: #98be65;">"${netstate}"</span>
    clean_exit
<span style="color: #51afef;">}</span>

main
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
